---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedTotalRows
source: html/deb92205-50b7-c475-f3b4-bd4777896806.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedTotalRows Property

"Total Segments"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewGraphSchedTotalRows { get; }
```